var deptArr = new Array();

deptArr[0] = [ "hidden" ];
deptArr[1] = [ "歷史學系","哲學系","中國文學系","外國語文學系","語言學研究所"];
deptArr[2] = [ "社會福利學系","心理學系","勞工關係學系","政治學系","傳播學系","戰略暨國際事務研究所"]
deptArr[3] = [ "經濟學系","財務金融學系","企業管理學系","會計與資訊科技學系","資訊管理學系"]
deptArr[4] = [ "成人及繼續教育學系","犯罪防治學系","運動競技學系"]
deptArr[5] = [ "數學系","地球與環境科學系","物理系","化學暨生物化學系","生物醫學科學系"]
deptArr[6] = [ "資訊工程學系","電機工程學系","機械工程學系","化學工程學系","通訊工程學系"]
deptArr[7] = [ "法律學系","財經法律學系"]

var projectArr = new Array();

projectArr[0] = [ ];
projectArr[0][1] = [ "中正之友捐款(112D01)","「小小力量，大大未來」小額捐款專戶(112D08)","校慶聯誼餐會募款專戶(112D09)","中正菁英願景基金(112D14)","中正大學「嘉有機會希望專戶」-學生獎助學金及急難救助金捐款(112DC61)"];

projectArr[1] = [ ];
projectArr[1][1] = [ "募款--歷史所(112DB04)"];
projectArr[1][2] = [ "募款--哲學所(112DB05)","募款--哲學系碩博士獎助學金(112DC01)"]
projectArr[1][3] = [ "募款--中文系(112DB02)","募款--中文系低收入戶學生獎助學金(112DC67)","募款--中文系學生急難助學金(112DC70)"]
projectArr[1][4] = [ "募款--外文系(112DB03)","募款--外文系畢業公演(112DB03-1)"]

projectArr[2] = [ ];
projectArr[2][1] = [ "募款--社福所(112DB11)","募款--社福系吳明儒老師研究室(112DB11-1)","募款--社福系獎學金(112DC22)"]
projectArr[2][2] = [ "募款--心理所(112DB12)","募款--心理所獎學金(112DC27)"]
projectArr[2][3] = [ "募款─勞工所(112DB13)","募款--勞工系獎學金(112DC20)"]
projectArr[2][4] = [ "募款--政治系(112DB14)"]
projectArr[2][5] = [ "募款--傳播系(112DB31)","募款--傳播系(畢業製作)(112DB31-1)","募款--傳播系(新傳獎)(112DB31-2)","募款--傳播系「數位傳播國際研討會」(112DB31-3)"]
projectArr[2][6] = [ "募款--戰略暨國際事務研究所(112DB48)","募款--戰略暨國際事務研究所獎助學金(112DC66)","募款--戰略暨國際事務研究所「蔡洪鳳招女士」獎學金(112DC71)"]

projectArr[3] = [ ];
projectArr[3][1] = [ "募款--經濟系(112DB46)","募款--經濟系獎學金(112DC09)"];
projectArr[3][2] = [ "募款--財金系所(112DB22)","募款--財金系獎學金(112DC53)","募款--財金系薪傳獎助學金(112DC57)"];
projectArr[3][3] = [ "募款--企管所系(112DB23)","募款--企管系創新創業相關活動及課程(112DB23-1)","募款--企管系獎助學金(112DC06)"];
projectArr[3][4] = [ "募款--會資系(112DB24)","募款-會計與資訊科技學系獎助學金(112DC08)"];
projectArr[3][5] = [ "募款--資管系獎學金(112DC17)","募款--資管所(112DB21)"];

projectArr[4] = [ ];
projectArr[4][1] = [ "募款--成教學系(112DB29)","募款--成教系「青銀生活服務，實踐大學社會責任」(112DB29-1)","募款--成教系「青銀共生基地營運經費」(112DB29-2)","募款--成教系獎學金(112DC52)"];
projectArr[4][2] = [ "募款--犯罪防治學系(112DB30)"];
projectArr[4][3] = [ "募款--運動競技學系(112DB55)","募款--運動競技學系「專項運動-排球訓練發展基金」(112DB55-1)","募款--運動競技學系「專項運動-網球訓練發展基金」(112DB55-2)","募款--運動競技學系「112年陽光女孩南區排球對抗聯賽」賽事獎金(112DB55-3)","募款--運動競技學系獎學金(112DC25)"];

projectArr[5] = [ ];
projectArr[5][1] = [ "募款--數學所(112DB07)"];
projectArr[5][2] = [ "募款--地球與環境科學系(112DB61)","募款--地環系許昺慕老師研究室(112DB61-1)"];
projectArr[5][3] = [ "募款--物理系獎助學金(112DC75)","募款--物理所(112DB08)"];
projectArr[5][4] = [ "募款--化生所(112DB09)","募款--化生系(112DB56)","募款--化生系(魏國佐)(112DB56-02)","募款--化生系獎助學金(112DC03)","募款--化生系獎學金(朱延和)(112DC30)"];
projectArr[5][5] = [ "募款--生醫系(112DB10)","募款--生醫系組隊參加「iGEM國際競賽」經費(112DB10-1)","募款-生醫系獎助學金(112DC04)"];

projectArr[6] = [ ];
projectArr[6][1] = [ "募款--資訊工程學系(112DB17)","募款--資訊工程學系作業系統技術產學聯盟研究經費(112DB17-3)","募款-資訊工程學系獎學金(112DC26)"];
projectArr[6][2] = [ "募款--電機工程學系(112DB50)","募款--電機系副教授許宏銘身故關懷慰助專戶(112DB50-1)","募款--電機系獎學金(112DC23)"];
projectArr[6][3] = [ "募款--機械工程學系(112DB18)","募款--機械系獎助學金(112DC64)"];
projectArr[6][4] = [ "募款--化學工程學系(112DB19)","募款--化工系獎學金(112DC16)"];
projectArr[6][5] = [ "募款--通訊工程學系(112DB65)","募款--通訊工程系清寒優秀獎學金(112DC05)","募款--通訊系系友會(112DB65-2)","募款--通訊系研究優秀獎學金(112DC68)"];

projectArr[7] = [ ];
projectArr[7][1] = [ "募款--法律系所(112DB26)","募款--法律系獎學金(112DC54)"];
projectArr[7][2] = [ "募款--財法系(112DB27)","募款--財法系「2023台灣智慧財產法學會著作權研討會」(112DB27-1)","募款--財法系獎學金(112DC10)","募款--財經法律研究中心(112DB60)"]



function select_dept(index){
    var deptSelect = document.getElementById('dept');

    if(index == 0){
        deptSelect.style.display = 'none';
    }
    else{
	    deptSelect.style.display = 'inline';
    }
	deptSelect.options.length = 0;
	for(var i=0; i<deptArr[index].length; i++){
		deptSelect.options[i] = new Option(deptArr[index][i], i+1);
	}
}

function select_project() {
    var projectSelect = document.getElementById('project');
    var deptSelect = document.getElementById('dept');
    var departmentSelect = document.getElementById('department');
    
    projectSelect.style.display = 'inline';
    projectSelect.options.length = 0;
    
    for (var i = 0; i < projectArr[departmentSelect.value][deptSelect.value].length; i++) {
        projectSelect.options[i] = new Option(
            projectArr[departmentSelect.value][deptSelect.value][i]
        );
    }

    return;
}


// 募款-台文所(112DB42)
// 募款-台文所楊智景老師研究室(112DB42-1)
// 募款-文學院「傑出校友陳金樹先生捐款」(112DB49-1)
// 募款-語言所(112DB64)
// 募款--理學院(112DB06)
// 募款--社科院(112DB15)
// 募款─工學院(112DB16)
// 募款─國立中正大學工學院留本永續發展基金帳戶(112DB16-1)
// 募款-管理學院(112DB20)
// 募款-國際事業聯盟捐款(112DB20-1)
// 募款-管理學院「玉山學術獎」(112DB20-2)
// 募款--法學院(112DB25)
// 募款--法學院之友專戶(112DB25-1)
// 募款--教育學院(112DB28)
// 募款--教育學院「2023年馬來亞大學國際研討會專戶」(112DB28-1)
// 募款--第18屆體育年會募資專款(112DB28-2)
// 募款-教育所(112DB43)
// 募款--師資培育中心(112DB82)
// 募款--語言所系獎學金(112DC02)
// 募款-前瞻製造系統頂尖研究中心獎助學金(112DC07)
// 捐款-晶片系統研究中心獎學金(112DC12)
// 中正大學學生獎助學金捐款(112DC14)
// 募款-江美雲女士紀念獎助學金(112DC21)
// 募款-豐泰文教基金會獎助金(112DC25-1)
// 募款-雷振聲先生紀念獎助學金(112DC29)
// 募款─理學院科學教育中心「民雄薪傳二手書店服務獎助學金」(112DC31)
// 募款─理學院科學教育中心「于淑民先生獎助學金」(112DC32)
// 募款-體育中心(贊助校隊)(112DC49)
// 募款-文學院「戴振茂先生、戴謝燧女士紀念清寒獎學金」(112DC50)
// 募款-法學院獎學金(112DC55)
// 募款-僑生、外籍生急難救助金(112DC56)
// 募款-管理學院獎助學金(112DC59)
// 募款-張林美津女士紀念獎助學金(112DC60)
// 中正大學「嘉有機會希望專戶」-學生獎助學金及急難救助金捐款(112DC61)
// 募款-邱子修博士紀念獎助學金(112DC63)
// 募款-中正大學學生獎助及弱勢學生助學專戶(112DC65)
// 募款-中正大學 似鳥〈NITORI〉國際獎學金(112DC69)
// 募款-台積電文教基金會與國立中正大學「嘉星計畫新生獎學金」(112DC72)
// 募款-研究發展處獎助學金(112DC73)
// 募款-尖端製程與軋鍛技術研究中心獎助學金(112DC74)
// 募款-國際事務處惠燊紀念獎學金(112DC76)
// 募款-CCU線上購物網輔導計畫 CCU online Store assistant Project(112D15)
// 超低功耗微控制器實驗室工程捐款(112DA06)
// 募款-醫療資訊管理中心(112DB34)
// 募款-製商整合科技中心(112DB35)
// 募款-製商整合研究中心「智慧生醫光機電跨領域整合產業聯盟」(112DB35-1)
// 募款-人文與社會研究中心(112DB36)
// 募款 -- 犯罪研究中心(112DB38)
// 募款-網際網路中心(112DB39)
// 募款-國立中正大學管理學院Amundi鋒裕匯理永續投資研究中心(112DB45)
// 募款-國立中正大學2023創新創業系列活動(112DB45-1)
// 募款-產業發展與預測研究中心(112DB51)
// 募款-奈米設計與原型中心(112DB52)
// 募款-自旋科技研究中心(112DB54)
// 募款-精緻電能應用研究中心(112DB63)
// 募款-國立中正大學高齡研究基地研究經費(112DB70)
// 募款--文學院手語語言學台灣研究中心(112DB71)
// 募款--人類研究倫理中心(112DB73)
// 募款--台灣法律資訊中心(112DB74)
// 募款-社會企業研究中心(112DB75)
// 募款--東協與南亞研究中心(112DB76)
// 募款-新農業科技暨產學推廣中心(112DB77)
// 募款--法學院兩岸四地法律交流中心(112DB78)
// 募款-大數據研究中心(112DB79)
// 募款─行銷策略與創意研究中心(112DB80)
// 募款-體育運動研究發展中心(112DB83)
// 募款--民意及市場調查中心(112DB84)
// 募款--智慧生活研究中心「臺印AI產學技術聯盟」(112DB85)
// 募款-國際文化創藝整合發展中心(112DB86)
// 募款─理學院科學教育中心運作基金(112DB87)
// 募款-112年中正大學統籌款(112D00)
// 中正之友捐款(112D01)
// 募款--防疫補助專款(112D02)
// 追求學術卓越捐款(112D04)
// 急難救助捐款(112D05)
// 學生社團活動捐款(112D06)
// 募款-「小小力量，大大未來」小額捐款專戶(112D08)
// 募款-校慶聯誼餐會募款專戶(112D09)
// 募款-講座教授獎勵金(112D11)
// 募款-中正菁英願景基金(112D14)
// 募款--體育中心(112DB32)
// 募款-通識中心(112DB33)
// 募款-李三財先生捐贈通識教育中心白桂英教師興學款(112DB33-1)
// 募款-通識教育中心「服務學習課程運作」(112DB33-2)
// 募款-徐子正先生捐贈胡維平教授實驗室設備及相關用品興學款(112DB33-3)
// 募款-科研成果產業化平台計畫(112DB37)
// 募款-課活組活動經費(112DB41)
// 募款-學安組學生社團聯合反毒宣教活動(112DB41-1)
// 募款-諮商中心-台灣學人課程合作計畫(112DB57)
// 募款-前瞻製造系統頂尖研究中心(112DB58)
// 募款-清江學習中心(112DB59)
// 募款-資訊處(112DB62)
// 募款--國際事務處(112DB66)
// 募款-紫荊書院(112DB67)
// 募款-紫荊書院院刊(112DB67-1)
// 募款-校務發展共識營(112DB68)
// 募款-學務處（活動、獎助學金、急難慰助經費）(112DB72)
// 募款-財團法人台灣法學基金會贊助本校活動中心演藝廳裝修案(112DB72-1)
// 募款-國立中正大學USR辦公室(112DB72-2)
// 募款--教務處(112DB81)
// 募款-學務處生活事務組「錦玉急難救助金」(112DB88)
// 募款-總務處「在地鄒族文化意象專款」(112DB89)
